results/iterations/redis_4kb_latency_iter9.txt
====== SET ======
  1000000 requests completed in 11.16 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.111 milliseconds (cumulative count 2)
50.000% <= 0.287 milliseconds (cumulative count 621719)
75.000% <= 0.295 milliseconds (cumulative count 829012)
87.500% <= 0.303 milliseconds (cumulative count 933775)
93.750% <= 0.311 milliseconds (cumulative count 969573)
98.438% <= 0.335 milliseconds (cumulative count 986018)
99.219% <= 0.391 milliseconds (cumulative count 992320)
99.609% <= 0.471 milliseconds (cumulative count 996471)
99.805% <= 0.527 milliseconds (cumulative count 998186)
99.902% <= 0.567 milliseconds (cumulative count 999162)
99.951% <= 0.583 milliseconds (cumulative count 999512)
99.976% <= 0.655 milliseconds (cumulative count 999761)
99.988% <= 0.823 milliseconds (cumulative count 999879)
99.994% <= 0.967 milliseconds (cumulative count 999939)
99.997% <= 1.087 milliseconds (cumulative count 999971)
99.998% <= 1.143 milliseconds (cumulative count 999985)
99.999% <= 1.231 milliseconds (cumulative count 999994)
100.000% <= 1.311 milliseconds (cumulative count 999997)
100.000% <= 1.423 milliseconds (cumulative count 999999)
100.000% <= 1.471 milliseconds (cumulative count 1000000)
100.000% <= 1.471 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.003% <= 0.207 milliseconds (cumulative count 29)
93.377% <= 0.303 milliseconds (cumulative count 933775)
99.352% <= 0.407 milliseconds (cumulative count 993515)
99.768% <= 0.503 milliseconds (cumulative count 997682)
99.967% <= 0.607 milliseconds (cumulative count 999674)
99.979% <= 0.703 milliseconds (cumulative count 999789)
99.987% <= 0.807 milliseconds (cumulative count 999873)
99.991% <= 0.903 milliseconds (cumulative count 999911)
99.995% <= 1.007 milliseconds (cumulative count 999949)
99.997% <= 1.103 milliseconds (cumulative count 999975)
99.999% <= 1.207 milliseconds (cumulative count 999991)
100.000% <= 1.303 milliseconds (cumulative count 999996)
100.000% <= 1.407 milliseconds (cumulative count 999998)
100.000% <= 1.503 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 89621.80 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.286     0.104     0.287     0.311     0.375     1.471
====== GET ======
  1000000 requests completed in 11.31 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 0.127 milliseconds (cumulative count 2)
50.000% <= 0.295 milliseconds (cumulative count 757418)
87.500% <= 0.303 milliseconds (cumulative count 915090)
93.750% <= 0.311 milliseconds (cumulative count 974794)
98.438% <= 0.319 milliseconds (cumulative count 991214)
99.219% <= 0.327 milliseconds (cumulative count 995966)
99.609% <= 0.335 milliseconds (cumulative count 997568)
99.805% <= 0.343 milliseconds (cumulative count 998254)
99.902% <= 0.463 milliseconds (cumulative count 999113)
99.951% <= 0.479 milliseconds (cumulative count 999681)
99.976% <= 0.487 milliseconds (cumulative count 999840)
99.988% <= 0.495 milliseconds (cumulative count 999911)
99.994% <= 0.503 milliseconds (cumulative count 999943)
99.997% <= 0.527 milliseconds (cumulative count 999974)
99.998% <= 0.575 milliseconds (cumulative count 999988)
99.999% <= 0.583 milliseconds (cumulative count 999995)
100.000% <= 0.591 milliseconds (cumulative count 999999)
100.000% <= 0.599 milliseconds (cumulative count 1000000)
100.000% <= 0.599 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.001% <= 0.207 milliseconds (cumulative count 11)
91.509% <= 0.303 milliseconds (cumulative count 915090)
99.883% <= 0.407 milliseconds (cumulative count 998835)
99.994% <= 0.503 milliseconds (cumulative count 999943)
100.000% <= 0.607 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 88432.97 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        0.289     0.120     0.295     0.311     0.319     0.599